OpenROAD v2.0-3074-g944855835 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[WARNING STA-0163] /foss/designs/ma2022/shiftregister/runs/RUN_2022.11.02_10.28.11/tmp/synthesis/resizer_sky130_fd_sc_hd__tt_025C_1v80.lib line 23, default_fanout_load is 0.0.
[INFO ODB-0222] Reading LEF file: /foss/designs/ma2022/shiftregister/runs/RUN_2022.11.02_10.28.11/tmp/merged_unpadded.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /foss/designs/ma2022/shiftregister/runs/RUN_2022.11.02_10.28.11/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /foss/designs/ma2022/shiftregister/runs/RUN_2022.11.02_10.28.11/tmp/placement/7-global.def
[INFO ODB-0128] Design: shiftregister
[INFO ODB-0130]     Created 208 pins.
[INFO ODB-0131]     Created 1506 components and 8336 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 5292 connections.
[INFO ODB-0133]     Created 1127 nets and 3044 connections.
[INFO ODB-0134] Finished DEF file: /foss/designs/ma2022/shiftregister/runs/RUN_2022.11.02_10.28.11/tmp/placement/7-global.def
###############################################################################
# Created by write_sdc
# Wed Nov  2 10:28:28 2022
###############################################################################
current_design shiftregister
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[32]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[33]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[34]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[35]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[36]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[37]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[38]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[39]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[40]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[41]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[42]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[43]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[44]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[45]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[46]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[47]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[48]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[49]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[50]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[51]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[52]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[53]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[54]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[55]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[56]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[57]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[58]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[59]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[60]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[61]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[62]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[63]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[64]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[65]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[66]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[67]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[68]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[69]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[70]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[71]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[72]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[73]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[74]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[75]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[76]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[77]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[78]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[79]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[80]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[81]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[82]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[83]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[84]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[85]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[86]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[87]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[88]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[89]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[90]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[91]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[92]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[93]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[94]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[95]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[96]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[97]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[98]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[99]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_read[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_in}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[14]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[15]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[16]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[17]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[18]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[19]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[20]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[21]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[22]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[23]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[24]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[25]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[26]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[27]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[28]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[29]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[30]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[31]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[32]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[33]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[34]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[35]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[36]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[37]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[38]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[39]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[40]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[41]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[42]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[43]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[44]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[45]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[46]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[47]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[48]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[49]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[50]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[51]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[52]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[53]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[54]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[55]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[56]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[57]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[58]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[59]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[60]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[61]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[62]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[63]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[64]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[65]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[66]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[67]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[68]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[69]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[70]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[71]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[72]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[73]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[74]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[75]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[76]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[77]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[78]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[79]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[80]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[81]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[82]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[83]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[84]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[85]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[86]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[87]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[88]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[89]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[90]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[91]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[92]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[93]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[94]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[95]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[96]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[97]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[98]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[99]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_load[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {s_out}]
set_load -pin_load 0.0334 [get_ports {r_load[99]}]
set_load -pin_load 0.0334 [get_ports {r_load[98]}]
set_load -pin_load 0.0334 [get_ports {r_load[97]}]
set_load -pin_load 0.0334 [get_ports {r_load[96]}]
set_load -pin_load 0.0334 [get_ports {r_load[95]}]
set_load -pin_load 0.0334 [get_ports {r_load[94]}]
set_load -pin_load 0.0334 [get_ports {r_load[93]}]
set_load -pin_load 0.0334 [get_ports {r_load[92]}]
set_load -pin_load 0.0334 [get_ports {r_load[91]}]
set_load -pin_load 0.0334 [get_ports {r_load[90]}]
set_load -pin_load 0.0334 [get_ports {r_load[89]}]
set_load -pin_load 0.0334 [get_ports {r_load[88]}]
set_load -pin_load 0.0334 [get_ports {r_load[87]}]
set_load -pin_load 0.0334 [get_ports {r_load[86]}]
set_load -pin_load 0.0334 [get_ports {r_load[85]}]
set_load -pin_load 0.0334 [get_ports {r_load[84]}]
set_load -pin_load 0.0334 [get_ports {r_load[83]}]
set_load -pin_load 0.0334 [get_ports {r_load[82]}]
set_load -pin_load 0.0334 [get_ports {r_load[81]}]
set_load -pin_load 0.0334 [get_ports {r_load[80]}]
set_load -pin_load 0.0334 [get_ports {r_load[79]}]
set_load -pin_load 0.0334 [get_ports {r_load[78]}]
set_load -pin_load 0.0334 [get_ports {r_load[77]}]
set_load -pin_load 0.0334 [get_ports {r_load[76]}]
set_load -pin_load 0.0334 [get_ports {r_load[75]}]
set_load -pin_load 0.0334 [get_ports {r_load[74]}]
set_load -pin_load 0.0334 [get_ports {r_load[73]}]
set_load -pin_load 0.0334 [get_ports {r_load[72]}]
set_load -pin_load 0.0334 [get_ports {r_load[71]}]
set_load -pin_load 0.0334 [get_ports {r_load[70]}]
set_load -pin_load 0.0334 [get_ports {r_load[69]}]
set_load -pin_load 0.0334 [get_ports {r_load[68]}]
set_load -pin_load 0.0334 [get_ports {r_load[67]}]
set_load -pin_load 0.0334 [get_ports {r_load[66]}]
set_load -pin_load 0.0334 [get_ports {r_load[65]}]
set_load -pin_load 0.0334 [get_ports {r_load[64]}]
set_load -pin_load 0.0334 [get_ports {r_load[63]}]
set_load -pin_load 0.0334 [get_ports {r_load[62]}]
set_load -pin_load 0.0334 [get_ports {r_load[61]}]
set_load -pin_load 0.0334 [get_ports {r_load[60]}]
set_load -pin_load 0.0334 [get_ports {r_load[59]}]
set_load -pin_load 0.0334 [get_ports {r_load[58]}]
set_load -pin_load 0.0334 [get_ports {r_load[57]}]
set_load -pin_load 0.0334 [get_ports {r_load[56]}]
set_load -pin_load 0.0334 [get_ports {r_load[55]}]
set_load -pin_load 0.0334 [get_ports {r_load[54]}]
set_load -pin_load 0.0334 [get_ports {r_load[53]}]
set_load -pin_load 0.0334 [get_ports {r_load[52]}]
set_load -pin_load 0.0334 [get_ports {r_load[51]}]
set_load -pin_load 0.0334 [get_ports {r_load[50]}]
set_load -pin_load 0.0334 [get_ports {r_load[49]}]
set_load -pin_load 0.0334 [get_ports {r_load[48]}]
set_load -pin_load 0.0334 [get_ports {r_load[47]}]
set_load -pin_load 0.0334 [get_ports {r_load[46]}]
set_load -pin_load 0.0334 [get_ports {r_load[45]}]
set_load -pin_load 0.0334 [get_ports {r_load[44]}]
set_load -pin_load 0.0334 [get_ports {r_load[43]}]
set_load -pin_load 0.0334 [get_ports {r_load[42]}]
set_load -pin_load 0.0334 [get_ports {r_load[41]}]
set_load -pin_load 0.0334 [get_ports {r_load[40]}]
set_load -pin_load 0.0334 [get_ports {r_load[39]}]
set_load -pin_load 0.0334 [get_ports {r_load[38]}]
set_load -pin_load 0.0334 [get_ports {r_load[37]}]
set_load -pin_load 0.0334 [get_ports {r_load[36]}]
set_load -pin_load 0.0334 [get_ports {r_load[35]}]
set_load -pin_load 0.0334 [get_ports {r_load[34]}]
set_load -pin_load 0.0334 [get_ports {r_load[33]}]
set_load -pin_load 0.0334 [get_ports {r_load[32]}]
set_load -pin_load 0.0334 [get_ports {r_load[31]}]
set_load -pin_load 0.0334 [get_ports {r_load[30]}]
set_load -pin_load 0.0334 [get_ports {r_load[29]}]
set_load -pin_load 0.0334 [get_ports {r_load[28]}]
set_load -pin_load 0.0334 [get_ports {r_load[27]}]
set_load -pin_load 0.0334 [get_ports {r_load[26]}]
set_load -pin_load 0.0334 [get_ports {r_load[25]}]
set_load -pin_load 0.0334 [get_ports {r_load[24]}]
set_load -pin_load 0.0334 [get_ports {r_load[23]}]
set_load -pin_load 0.0334 [get_ports {r_load[22]}]
set_load -pin_load 0.0334 [get_ports {r_load[21]}]
set_load -pin_load 0.0334 [get_ports {r_load[20]}]
set_load -pin_load 0.0334 [get_ports {r_load[19]}]
set_load -pin_load 0.0334 [get_ports {r_load[18]}]
set_load -pin_load 0.0334 [get_ports {r_load[17]}]
set_load -pin_load 0.0334 [get_ports {r_load[16]}]
set_load -pin_load 0.0334 [get_ports {r_load[15]}]
set_load -pin_load 0.0334 [get_ports {r_load[14]}]
set_load -pin_load 0.0334 [get_ports {r_load[13]}]
set_load -pin_load 0.0334 [get_ports {r_load[12]}]
set_load -pin_load 0.0334 [get_ports {r_load[11]}]
set_load -pin_load 0.0334 [get_ports {r_load[10]}]
set_load -pin_load 0.0334 [get_ports {r_load[9]}]
set_load -pin_load 0.0334 [get_ports {r_load[8]}]
set_load -pin_load 0.0334 [get_ports {r_load[7]}]
set_load -pin_load 0.0334 [get_ports {r_load[6]}]
set_load -pin_load 0.0334 [get_ports {r_load[5]}]
set_load -pin_load 0.0334 [get_ports {r_load[4]}]
set_load -pin_load 0.0334 [get_ports {r_load[3]}]
set_load -pin_load 0.0334 [get_ports {r_load[2]}]
set_load -pin_load 0.0334 [get_ports {r_load[1]}]
set_load -pin_load 0.0334 [get_ports {r_load[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[99]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[98]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[97]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[96]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[95]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[94]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[93]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[92]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[91]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[90]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[89]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[88]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[87]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[86]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[85]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[84]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[83]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[82]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[81]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[80]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[79]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[78]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[77]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[76]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[75]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[74]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[73]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[72]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[71]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[70]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[69]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[68]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[67]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[66]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[65]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[64]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {r_read[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
[INFO RSZ-0027] Inserted 104 input buffers.
[INFO RSZ-0028] Inserted 101 output buffers.
[INFO RSZ-0058] Using max wire length 2319um.
[INFO RSZ-0039] Resized 965 instances.
Placement Analysis
---------------------------------
total displacement       5690.8 u
average displacement        3.3 u
max displacement           44.8 u
original HPWL           32902.0 u
legalized HPWL          38127.7 u
delta HPWL                   16 %

[INFO DPL-0020] Mirrored 455 instances
[INFO DPL-0021] HPWL before           38127.7 u
[INFO DPL-0022] HPWL after            37563.9 u
[INFO DPL-0023] HPWL delta               -1.5 %
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: reset (input port clocked by clk)
Endpoint: _1787_ (removal check against rising-edge clock clk)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.15   20.15 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.15 v _1551_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.09    0.16   20.31 v _1551_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0593_ (net)
                  0.09    0.00   20.31 v _1570_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18   20.49 v _1570_/X (sky130_fd_sc_hd__buf_2)
     5    0.03                           _0597_ (net)
                  0.08    0.00   20.49 v _1574_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.05   20.54 ^ _1574_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _0016_ (net)
                  0.03    0.00   20.54 ^ _1787_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                 20.54   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1787_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.35    0.60   library removal time
                                  0.60   data required time
-----------------------------------------------------------------------------
                                  0.60   data required time
                                -20.54   data arrival time
-----------------------------------------------------------------------------
                                 19.95   slack (MET)


Startpoint: reset (input port clocked by clk)
Endpoint: _1775_ (removal check against rising-edge clock clk)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.15   20.15 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.15 v _1551_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.09    0.16   20.31 v _1551_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0593_ (net)
                  0.09    0.00   20.31 v _1558_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18   20.49 v _1558_/X (sky130_fd_sc_hd__buf_2)
     5    0.03                           _0595_ (net)
                  0.08    0.00   20.49 v _1560_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.05   20.54 ^ _1560_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _0004_ (net)
                  0.03    0.00   20.54 ^ _1775_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                 20.54   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1775_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.35    0.60   library removal time
                                  0.60   data required time
-----------------------------------------------------------------------------
                                  0.60   data required time
                                -20.54   data arrival time
-----------------------------------------------------------------------------
                                 19.95   slack (MET)


Startpoint: reset (input port clocked by clk)
Endpoint: _1801_ (removal check against rising-edge clock clk)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.15   20.15 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.15 v _1582_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.09    0.16   20.31 v _1582_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0599_ (net)
                  0.09    0.00   20.31 v _1589_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18   20.49 v _1589_/X (sky130_fd_sc_hd__buf_2)
     5    0.03                           _0601_ (net)
                  0.08    0.00   20.49 v _1592_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.05   20.54 ^ _1592_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _0030_ (net)
                  0.03    0.00   20.54 ^ _1801_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                 20.54   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1801_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.35    0.60   library removal time
                                  0.60   data required time
-----------------------------------------------------------------------------
                                  0.60   data required time
                                -20.54   data arrival time
-----------------------------------------------------------------------------
                                 19.95   slack (MET)


Startpoint: reset (input port clocked by clk)
Endpoint: _1785_ (removal check against rising-edge clock clk)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.15   20.15 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.15 v _1551_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.09    0.16   20.31 v _1551_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0593_ (net)
                  0.09    0.00   20.31 v _1570_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18   20.49 v _1570_/X (sky130_fd_sc_hd__buf_2)
     5    0.03                           _0597_ (net)
                  0.08    0.00   20.49 v _1572_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.05   20.55 ^ _1572_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _0014_ (net)
                  0.03    0.00   20.55 ^ _1785_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                 20.55   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1785_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.35    0.60   library removal time
                                  0.60   data required time
-----------------------------------------------------------------------------
                                  0.60   data required time
                                -20.55   data arrival time
-----------------------------------------------------------------------------
                                 19.95   slack (MET)


Startpoint: reset (input port clocked by clk)
Endpoint: _1829_ (removal check against rising-edge clock clk)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.15   20.15 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.15 v _1613_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.08    0.16   20.31 v _1613_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0605_ (net)
                  0.08    0.00   20.31 v _1626_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18   20.49 v _1626_/X (sky130_fd_sc_hd__buf_2)
     5    0.03                           _0608_ (net)
                  0.08    0.00   20.49 v _1627_/A (sky130_fd_sc_hd__inv_2)
                  0.03    0.05   20.55 ^ _1627_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _0058_ (net)
                  0.03    0.00   20.55 ^ _1829_/RESET_B (sky130_fd_sc_hd__dfrtp_1)
                                 20.55   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1829_/CLK (sky130_fd_sc_hd__dfrtp_1)
                          0.35    0.60   library removal time
                                  0.60   data required time
-----------------------------------------------------------------------------
                                  0.60   data required time
                                -20.55   data arrival time
-----------------------------------------------------------------------------
                                 19.95   slack (MET)


Startpoint: _1650_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _1650_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _1650_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.07    0.35    0.35 ^ _1650_/Q (sky130_fd_sc_hd__dfrtp_1)
     2    0.01                           net171 (net)
                  0.07    0.00    0.35 ^ _1380_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.12    0.47 ^ _1380_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0554_ (net)
                  0.04    0.00    0.47 ^ _1381_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.05    0.08    0.55 ^ _1381_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0279_ (net)
                  0.05    0.00    0.55 ^ _1650_/D (sky130_fd_sc_hd__dfrtp_1)
                                  0.55   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1650_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.55   data arrival time
-----------------------------------------------------------------------------
                                  0.32   slack (MET)


Startpoint: _1703_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _1703_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _1703_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.07    0.36    0.36 ^ _1703_/Q (sky130_fd_sc_hd__dfrtp_1)
     2    0.01                           net159 (net)
                  0.07    0.00    0.36 ^ _1262_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.12    0.48 ^ _1262_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0489_ (net)
                  0.04    0.00    0.48 ^ _1263_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.04    0.07    0.55 ^ _1263_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0332_ (net)
                  0.04    0.00    0.55 ^ _1703_/D (sky130_fd_sc_hd__dfrtp_1)
                                  0.55   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1703_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.55   data arrival time
-----------------------------------------------------------------------------
                                  0.32   slack (MET)


Startpoint: _1700_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _1700_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _1700_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.07    0.36    0.36 ^ _1700_/Q (sky130_fd_sc_hd__dfrtp_1)
     2    0.01                           net156 (net)
                  0.07    0.00    0.36 ^ _1268_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.12    0.47 ^ _1268_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0492_ (net)
                  0.04    0.00    0.47 ^ _1269_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.05    0.08    0.55 ^ _1269_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0329_ (net)
                  0.05    0.00    0.55 ^ _1700_/D (sky130_fd_sc_hd__dfrtp_1)
                                  0.55   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1700_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.55   data arrival time
-----------------------------------------------------------------------------
                                  0.32   slack (MET)


Startpoint: _1678_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _1678_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _1678_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.06    0.35    0.35 ^ _1678_/Q (sky130_fd_sc_hd__dfrtp_1)
     2    0.01                           net132 (net)
                  0.06    0.00    0.35 ^ _1318_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.12    0.47 ^ _1318_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0520_ (net)
                  0.04    0.00    0.47 ^ _1319_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.05    0.08    0.55 ^ _1319_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0307_ (net)
                  0.05    0.00    0.55 ^ _1678_/D (sky130_fd_sc_hd__dfrtp_1)
                                  0.55   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1678_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.55   data arrival time
-----------------------------------------------------------------------------
                                  0.32   slack (MET)


Startpoint: _1649_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _1649_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _1649_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.07    0.35    0.35 ^ _1649_/Q (sky130_fd_sc_hd__dfrtp_1)
     2    0.01                           net160 (net)
                  0.07    0.00    0.35 ^ _1382_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.12    0.47 ^ _1382_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0555_ (net)
                  0.04    0.00    0.47 ^ _1383_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.05    0.08    0.55 ^ _1383_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0278_ (net)
                  0.05    0.00    0.55 ^ _1649_/D (sky130_fd_sc_hd__dfrtp_1)
                                  0.55   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1649_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.55   data arrival time
-----------------------------------------------------------------------------
                                  0.32   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: reset (input port clocked by clk)
Endpoint: _1709_ (recovery check against rising-edge clock clk)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.16   20.17 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.17 v _1395_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.08    0.18   20.35 v _1395_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0562_ (net)
                  0.08    0.00   20.35 v _1458_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.09    0.18   20.53 v _1458_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0575_ (net)
                  0.09    0.00   20.53 v _1477_/A (sky130_fd_sc_hd__clkbuf_4)
                  0.09    0.22   20.75 v _1477_/X (sky130_fd_sc_hd__clkbuf_4)
     5    0.04                           _0579_ (net)
                  0.09    0.00   20.75 v _1478_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07   20.82 ^ _1478_/Y (sky130_fd_sc_hd__inv_2)
     1    0.01                           _0138_ (net)
                  0.04    0.00   20.82 ^ _1709_/RESET_B (sky130_fd_sc_hd__dfrtp_4)
                                 20.82   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1709_/CLK (sky130_fd_sc_hd__dfrtp_4)
                          0.25  100.00   library recovery time
                                100.00   data required time
-----------------------------------------------------------------------------
                                100.00   data required time
                                -20.82   data arrival time
-----------------------------------------------------------------------------
                                 79.18   slack (MET)


Startpoint: reset (input port clocked by clk)
Endpoint: _1727_ (recovery check against rising-edge clock clk)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.16   20.17 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.17 v _1395_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.08    0.18   20.35 v _1395_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0562_ (net)
                  0.08    0.00   20.35 v _1489_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.10    0.19   20.53 v _1489_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0581_ (net)
                  0.10    0.00   20.53 v _1496_/A (sky130_fd_sc_hd__buf_2)
                  0.09    0.22   20.75 v _1496_/X (sky130_fd_sc_hd__buf_2)
     5    0.04                           _0583_ (net)
                  0.09    0.00   20.75 v _1500_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07   20.82 ^ _1500_/Y (sky130_fd_sc_hd__inv_2)
     1    0.01                           _0156_ (net)
                  0.04    0.00   20.82 ^ _1727_/RESET_B (sky130_fd_sc_hd__dfrtp_2)
                                 20.82   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1727_/CLK (sky130_fd_sc_hd__dfrtp_2)
                          0.25  100.00   library recovery time
                                100.00   data required time
-----------------------------------------------------------------------------
                                100.00   data required time
                                -20.82   data arrival time
-----------------------------------------------------------------------------
                                 79.18   slack (MET)


Startpoint: reset (input port clocked by clk)
Endpoint: _1726_ (recovery check against rising-edge clock clk)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.16   20.17 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.17 v _1395_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.08    0.18   20.35 v _1395_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0562_ (net)
                  0.08    0.00   20.35 v _1489_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.10    0.19   20.53 v _1489_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0581_ (net)
                  0.10    0.00   20.53 v _1496_/A (sky130_fd_sc_hd__buf_2)
                  0.09    0.22   20.75 v _1496_/X (sky130_fd_sc_hd__buf_2)
     5    0.04                           _0583_ (net)
                  0.09    0.00   20.75 v _1499_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07   20.82 ^ _1499_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _0155_ (net)
                  0.04    0.00   20.82 ^ _1726_/RESET_B (sky130_fd_sc_hd__dfrtp_4)
                                 20.82   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1726_/CLK (sky130_fd_sc_hd__dfrtp_4)
                          0.25  100.00   library recovery time
                                100.00   data required time
-----------------------------------------------------------------------------
                                100.00   data required time
                                -20.82   data arrival time
-----------------------------------------------------------------------------
                                 79.18   slack (MET)


Startpoint: reset (input port clocked by clk)
Endpoint: _1725_ (recovery check against rising-edge clock clk)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.16   20.17 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.17 v _1395_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.08    0.18   20.35 v _1395_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0562_ (net)
                  0.08    0.00   20.35 v _1489_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.10    0.19   20.53 v _1489_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0581_ (net)
                  0.10    0.00   20.53 v _1496_/A (sky130_fd_sc_hd__buf_2)
                  0.09    0.22   20.75 v _1496_/X (sky130_fd_sc_hd__buf_2)
     5    0.04                           _0583_ (net)
                  0.09    0.00   20.75 v _1498_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07   20.82 ^ _1498_/Y (sky130_fd_sc_hd__inv_2)
     1    0.00                           _0154_ (net)
                  0.04    0.00   20.82 ^ _1725_/RESET_B (sky130_fd_sc_hd__dfrtp_4)
                                 20.82   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1725_/CLK (sky130_fd_sc_hd__dfrtp_4)
                          0.25  100.00   library recovery time
                                100.00   data required time
-----------------------------------------------------------------------------
                                100.00   data required time
                                -20.82   data arrival time
-----------------------------------------------------------------------------
                                 79.18   slack (MET)


Startpoint: reset (input port clocked by clk)
Endpoint: _1718_ (recovery check against rising-edge clock clk)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.16   20.17 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.17 v _1395_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.08    0.18   20.35 v _1395_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0562_ (net)
                  0.08    0.00   20.35 v _1458_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.09    0.18   20.53 v _1458_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0575_ (net)
                  0.09    0.00   20.53 v _1483_/A (sky130_fd_sc_hd__buf_2)
                  0.09    0.21   20.74 v _1483_/X (sky130_fd_sc_hd__buf_2)
     5    0.03                           _0580_ (net)
                  0.09    0.00   20.74 v _1488_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07   20.81 ^ _1488_/Y (sky130_fd_sc_hd__inv_2)
     1    0.01                           _0147_ (net)
                  0.04    0.00   20.81 ^ _1718_/RESET_B (sky130_fd_sc_hd__dfrtp_4)
                                 20.81   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1718_/CLK (sky130_fd_sc_hd__dfrtp_4)
                          0.25  100.00   library recovery time
                                100.00   data required time
-----------------------------------------------------------------------------
                                100.00   data required time
                                -20.81   data arrival time
-----------------------------------------------------------------------------
                                 79.19   slack (MET)


Startpoint: read (input port clocked by clk)
Endpoint: _1843_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 ^ input external delay
                  0.02    0.01   20.01 ^ read (in)
     1    0.00                           read (net)
                  0.02    0.00   20.01 ^ input102/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.19   20.21 ^ input102/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net102 (net)
                  0.16    0.00   20.21 ^ _0822_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.24   20.44 ^ _0822_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _0611_ (net)
                  0.19    0.00   20.44 ^ _0823_/A (sky130_fd_sc_hd__clkbuf_4)
                  0.14    0.27   20.71 ^ _0823_/X (sky130_fd_sc_hd__clkbuf_4)
     5    0.04                           _0612_ (net)
                  0.14    0.00   20.71 ^ _0824_/S (sky130_fd_sc_hd__mux2_2)
                  0.08    0.42   21.13 v _0824_/X (sky130_fd_sc_hd__mux2_2)
     1    0.02                           _0613_ (net)
                  0.08    0.00   21.13 v _0828_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.05    0.30   21.44 v _0828_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0617_ (net)
                  0.05    0.00   21.44 v _0829_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.03    0.10   21.53 v _0829_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0272_ (net)
                  0.03    0.00   21.53 v _1843_/D (sky130_fd_sc_hd__dfrtp_1)
                                 21.53   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1843_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.08   99.67   library setup time
                                 99.67   data required time
-----------------------------------------------------------------------------
                                 99.67   data required time
                                -21.53   data arrival time
-----------------------------------------------------------------------------
                                 78.13   slack (MET)


Startpoint: read (input port clocked by clk)
Endpoint: _1823_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 ^ input external delay
                  0.02    0.01   20.01 ^ read (in)
     1    0.00                           read (net)
                  0.02    0.00   20.01 ^ input102/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.19   20.21 ^ input102/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net102 (net)
                  0.16    0.00   20.21 ^ _0822_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.24   20.44 ^ _0822_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _0611_ (net)
                  0.19    0.00   20.44 ^ _0893_/A (sky130_fd_sc_hd__buf_2)
                  0.18    0.26   20.70 ^ _0893_/X (sky130_fd_sc_hd__buf_2)
     5    0.04                           _0662_ (net)
                  0.18    0.00   20.70 ^ _0894_/S (sky130_fd_sc_hd__mux2_1)
                  0.10    0.41   21.12 v _0894_/X (sky130_fd_sc_hd__mux2_1)
     1    0.01                           _0663_ (net)
                  0.10    0.00   21.12 v _0896_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.31   21.43 v _0896_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0665_ (net)
                  0.06    0.00   21.43 v _0897_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.03    0.10   21.52 v _0897_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0252_ (net)
                  0.03    0.00   21.52 v _1823_/D (sky130_fd_sc_hd__dfrtp_1)
                                 21.52   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1823_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.08   99.67   library setup time
                                 99.67   data required time
-----------------------------------------------------------------------------
                                 99.67   data required time
                                -21.52   data arrival time
-----------------------------------------------------------------------------
                                 78.14   slack (MET)


Startpoint: read (input port clocked by clk)
Endpoint: _1822_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 ^ input external delay
                  0.02    0.01   20.01 ^ read (in)
     1    0.00                           read (net)
                  0.02    0.00   20.01 ^ input102/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.19   20.21 ^ input102/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net102 (net)
                  0.16    0.00   20.21 ^ _0822_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.24   20.44 ^ _0822_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _0611_ (net)
                  0.19    0.00   20.44 ^ _0893_/A (sky130_fd_sc_hd__buf_2)
                  0.18    0.26   20.70 ^ _0893_/X (sky130_fd_sc_hd__buf_2)
     5    0.04                           _0662_ (net)
                  0.18    0.00   20.70 ^ _0898_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35   21.06 v _0898_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0666_ (net)
                  0.05    0.00   21.06 v _0899_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.30   21.36 v _0899_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0667_ (net)
                  0.06    0.00   21.36 v _0900_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.03    0.10   21.45 v _0900_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0251_ (net)
                  0.03    0.00   21.45 v _1822_/D (sky130_fd_sc_hd__dfrtp_1)
                                 21.45   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1822_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.08   99.67   library setup time
                                 99.67   data required time
-----------------------------------------------------------------------------
                                 99.67   data required time
                                -21.45   data arrival time
-----------------------------------------------------------------------------
                                 78.21   slack (MET)


Startpoint: read (input port clocked by clk)
Endpoint: _1840_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 ^ input external delay
                  0.02    0.01   20.01 ^ read (in)
     1    0.00                           read (net)
                  0.02    0.00   20.01 ^ input102/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.19   20.21 ^ input102/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net102 (net)
                  0.16    0.00   20.21 ^ _0822_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.24   20.44 ^ _0822_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _0611_ (net)
                  0.19    0.00   20.44 ^ _0823_/A (sky130_fd_sc_hd__clkbuf_4)
                  0.14    0.27   20.71 ^ _0823_/X (sky130_fd_sc_hd__clkbuf_4)
     5    0.04                           _0612_ (net)
                  0.14    0.00   20.71 ^ _0836_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.34   21.06 v _0836_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0622_ (net)
                  0.05    0.00   21.06 v _0837_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.30   21.35 v _0837_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0623_ (net)
                  0.06    0.00   21.35 v _0838_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.03    0.10   21.45 v _0838_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0269_ (net)
                  0.03    0.00   21.45 v _1840_/D (sky130_fd_sc_hd__dfrtp_1)
                                 21.45   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1840_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.08   99.67   library setup time
                                 99.67   data required time
-----------------------------------------------------------------------------
                                 99.67   data required time
                                -21.45   data arrival time
-----------------------------------------------------------------------------
                                 78.22   slack (MET)


Startpoint: read (input port clocked by clk)
Endpoint: _1839_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 ^ input external delay
                  0.02    0.01   20.01 ^ read (in)
     1    0.00                           read (net)
                  0.02    0.00   20.01 ^ input102/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.19   20.21 ^ input102/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net102 (net)
                  0.16    0.00   20.21 ^ _0822_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.24   20.44 ^ _0822_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _0611_ (net)
                  0.19    0.00   20.44 ^ _0823_/A (sky130_fd_sc_hd__clkbuf_4)
                  0.14    0.27   20.71 ^ _0823_/X (sky130_fd_sc_hd__clkbuf_4)
     5    0.04                           _0612_ (net)
                  0.14    0.00   20.71 ^ _0839_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.34   21.06 v _0839_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0624_ (net)
                  0.05    0.00   21.06 v _0840_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.06    0.29   21.35 v _0840_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0625_ (net)
                  0.06    0.00   21.35 v _0841_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.03    0.10   21.45 v _0841_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0268_ (net)
                  0.03    0.00   21.45 v _1839_/D (sky130_fd_sc_hd__dfrtp_2)
                                 21.45   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1839_/CLK (sky130_fd_sc_hd__dfrtp_2)
                         -0.08   99.67   library setup time
                                 99.67   data required time
-----------------------------------------------------------------------------
                                 99.67   data required time
                                -21.45   data arrival time
-----------------------------------------------------------------------------
                                 78.22   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: reset (input port clocked by clk)
Endpoint: _1709_ (recovery check against rising-edge clock clk)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 v input external delay
                  0.01    0.00   20.00 v reset (in)
     1    0.00                           reset (net)
                  0.01    0.00   20.00 v input103/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.16   20.17 v input103/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net103 (net)
                  0.08    0.00   20.17 v _1395_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.08    0.18   20.35 v _1395_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0562_ (net)
                  0.08    0.00   20.35 v _1458_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.09    0.18   20.53 v _1458_/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           _0575_ (net)
                  0.09    0.00   20.53 v _1477_/A (sky130_fd_sc_hd__clkbuf_4)
                  0.09    0.22   20.75 v _1477_/X (sky130_fd_sc_hd__clkbuf_4)
     5    0.04                           _0579_ (net)
                  0.09    0.00   20.75 v _1478_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.07   20.82 ^ _1478_/Y (sky130_fd_sc_hd__inv_2)
     1    0.01                           _0138_ (net)
                  0.04    0.00   20.82 ^ _1709_/RESET_B (sky130_fd_sc_hd__dfrtp_4)
                                 20.82   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1709_/CLK (sky130_fd_sc_hd__dfrtp_4)
                          0.25  100.00   library recovery time
                                100.00   data required time
-----------------------------------------------------------------------------
                                100.00   data required time
                                -20.82   data arrival time
-----------------------------------------------------------------------------
                                 79.18   slack (MET)


Startpoint: read (input port clocked by clk)
Endpoint: _1843_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                         20.00   20.00 ^ input external delay
                  0.02    0.01   20.01 ^ read (in)
     1    0.00                           read (net)
                  0.02    0.00   20.01 ^ input102/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.19   20.21 ^ input102/X (sky130_fd_sc_hd__buf_2)
     4    0.03                           net102 (net)
                  0.16    0.00   20.21 ^ _0822_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.24   20.44 ^ _0822_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     5    0.02                           _0611_ (net)
                  0.19    0.00   20.44 ^ _0823_/A (sky130_fd_sc_hd__clkbuf_4)
                  0.14    0.27   20.71 ^ _0823_/X (sky130_fd_sc_hd__clkbuf_4)
     5    0.04                           _0612_ (net)
                  0.14    0.00   20.71 ^ _0824_/S (sky130_fd_sc_hd__mux2_2)
                  0.08    0.42   21.13 v _0824_/X (sky130_fd_sc_hd__mux2_2)
     1    0.02                           _0613_ (net)
                  0.08    0.00   21.13 v _0828_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.05    0.30   21.44 v _0828_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0617_ (net)
                  0.05    0.00   21.44 v _0829_/A (sky130_fd_sc_hd__clkbuf_1)
                  0.03    0.10   21.53 v _0829_/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.00                           _0272_ (net)
                  0.03    0.00   21.53 v _1843_/D (sky130_fd_sc_hd__dfrtp_1)
                                 21.53   data arrival time

                  0.15  100.00  100.00   clock clk (rise edge)
                          0.00  100.00   clock network delay (ideal)
                         -0.25   99.75   clock uncertainty
                          0.00   99.75   clock reconvergence pessimism
                                 99.75 ^ _1843_/CLK (sky130_fd_sc_hd__dfrtp_1)
                         -0.08   99.67   library setup time
                                 99.67   data required time
-----------------------------------------------------------------------------
                                 99.67   data required time
                                -21.53   data arrival time
-----------------------------------------------------------------------------
                                 78.13   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 78.13

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.32
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk
Latency      CRPR       Skew
_1644_/CLK ^
   1.28
_1644_/CLK ^
   1.16      0.00       0.12

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             8.66e-05   7.41e-06   1.71e-09   9.40e-05  70.6%
Combinational          1.66e-05   2.25e-05   4.16e-09   3.91e-05  29.4%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  1.03e-04   2.99e-05   5.86e-09   1.33e-04 100.0%
                          77.5%      22.5%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 12743 u^2 49% utilization.
area_report_end
