OpenROAD v2.0-3074-g944855835 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /foss/designs/ma2022/fll_2/runs/RUN_2022.11.02_10.21.17/tmp/merged_unpadded.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /foss/designs/ma2022/fll_2/runs/RUN_2022.11.02_10.21.17/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /foss/designs/ma2022/fll_2/runs/RUN_2022.11.02_10.21.17/tmp/floorplan/6-pdn.def
[INFO ODB-0128] Design: fll_wrapper_2
[INFO ODB-0130]     Created 70 pins.
[INFO ODB-0131]     Created 491 components and 2848 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 1778 connections.
[INFO ODB-0133]     Created 384 nets and 1070 connections.
[INFO ODB-0134] Finished DEF file: /foss/designs/ma2022/fll_2/runs/RUN_2022.11.02_10.21.17/tmp/floorplan/6-pdn.def
[WARNING STA-0163] /foss/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib line 23, default_fanout_load is 0.0.
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 86480 89760
[INFO GPL-0006] NumInstances: 491
[INFO GPL-0007] NumPlaceInstances: 340
[INFO GPL-0008] NumFixedInstances: 151
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 384
[INFO GPL-0011] NumPins: 1138
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 92290 103010
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 86480 89760
[INFO GPL-0016] CoreArea: 6386124800
[INFO GPL-0017] NonPlaceInstsArea: 334070400
[INFO GPL-0018] PlaceInstsArea: 3300665600
[INFO GPL-0019] Util(%): 54.54
[INFO GPL-0020] StdInstsArea: 3300665600
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG Error: 0.00000008 HPWL: 9602970
[InitialPlace]  Iter: 2 CG Error: 0.00000009 HPWL: 8131521
[InitialPlace]  Iter: 3 CG Error: 0.00000011 HPWL: 8089276
[InitialPlace]  Iter: 4 CG Error: 0.00000012 HPWL: 8052373
[InitialPlace]  Iter: 5 CG Error: 0.00000010 HPWL: 8025184
[INFO GPL-0031] FillerInit: NumGCells: 475
[INFO GPL-0032] FillerInit: NumGNets: 384
[INFO GPL-0033] FillerInit: NumGPins: 1138
[INFO GPL-0023] TargetDensity: 0.75
[INFO GPL-0024] AveragePlaceInstArea: 9707840
[INFO GPL-0025] IdealBinArea: 12943787
[INFO GPL-0026] IdealBinCnt: 493
[INFO GPL-0027] TotalBinArea: 6386124800
[INFO GPL-0028] BinCnt: 16 16
[INFO GPL-0029] BinSize: 5060 4930
[INFO GPL-0030] NumBins: 256
[NesterovSolve] Iter: 1 overflow: 0.786557 HPWL: 6089592
[NesterovSolve] Iter: 10 overflow: 0.64564 HPWL: 6491460
[NesterovSolve] Iter: 20 overflow: 0.630595 HPWL: 6437526
[NesterovSolve] Iter: 30 overflow: 0.619314 HPWL: 6412649
[NesterovSolve] Iter: 40 overflow: 0.621173 HPWL: 6417009
[NesterovSolve] Iter: 50 overflow: 0.624581 HPWL: 6421115
[NesterovSolve] Iter: 60 overflow: 0.625268 HPWL: 6423168
[NesterovSolve] Iter: 70 overflow: 0.623425 HPWL: 6420634
[NesterovSolve] Iter: 80 overflow: 0.622632 HPWL: 6419357
[NesterovSolve] Iter: 90 overflow: 0.622769 HPWL: 6420115
[NesterovSolve] Iter: 100 overflow: 0.622902 HPWL: 6421344
[NesterovSolve] Iter: 110 overflow: 0.622121 HPWL: 6422119
[NesterovSolve] Iter: 120 overflow: 0.620878 HPWL: 6423073
[NesterovSolve] Iter: 130 overflow: 0.619532 HPWL: 6425415
[NesterovSolve] Iter: 140 overflow: 0.617842 HPWL: 6429612
[NesterovSolve] Iter: 150 overflow: 0.614733 HPWL: 6433906
[NesterovSolve] Iter: 160 overflow: 0.609971 HPWL: 6435981
[NesterovSolve] Iter: 170 overflow: 0.605173 HPWL: 6437715
[NesterovSolve] Iter: 180 overflow: 0.597644 HPWL: 6444675
[NesterovSolve] Iter: 190 overflow: 0.58581 HPWL: 6455945
[NesterovSolve] Iter: 200 overflow: 0.571138 HPWL: 6465260
[NesterovSolve] Iter: 210 overflow: 0.547405 HPWL: 6464721
[NesterovSolve] Iter: 220 overflow: 0.524001 HPWL: 6472165
[NesterovSolve] Iter: 230 overflow: 0.490732 HPWL: 6486204
[NesterovSolve] Iter: 240 overflow: 0.463335 HPWL: 6512224
[NesterovSolve] Iter: 250 overflow: 0.430052 HPWL: 6522199
[NesterovSolve] Iter: 260 overflow: 0.3944 HPWL: 6568697
[NesterovSolve] Iter: 270 overflow: 0.352587 HPWL: 6602726
[NesterovSolve] Iter: 280 overflow: 0.314811 HPWL: 6610948
[NesterovSolve] Iter: 290 overflow: 0.283148 HPWL: 6639394
[NesterovSolve] Iter: 300 overflow: 0.243587 HPWL: 6663815
[NesterovSolve] Iter: 310 overflow: 0.206521 HPWL: 6690690
[NesterovSolve] Iter: 320 overflow: 0.174703 HPWL: 6723557
[NesterovSolve] Iter: 330 overflow: 0.147651 HPWL: 6734569
[NesterovSolve] Iter: 340 overflow: 0.126824 HPWL: 6761573
[NesterovSolve] Iter: 350 overflow: 0.109758 HPWL: 6793029
[NesterovSolve] Finished with Overflow: 0.098339
[WARNING STA-0053] /foss/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib line 1, library sky130_fd_sc_hd__tt_025C_1v80 already exists.
[WARNING STA-0163] /foss/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib line 23, default_fanout_load is 0.0.
###############################################################################
# Created by write_sdc
# Wed Nov  2 10:21:32 2022
###############################################################################
current_design fll_wrapper_2
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 40.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[8]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lower[9]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[8]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_time[9]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[8]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_val[9]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[8]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {upper[9]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[0]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[1]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[2]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[3]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[4]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[5]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[6]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[7]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[8]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buffer_val[9]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {corner[0]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {corner[1]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {corner[2]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[0]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[1]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[2]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[3]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[4]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[5]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[6]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[7]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[8]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac[9]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lock}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {lock}]
set_load -pin_load 0.0334 [get_ports {buffer_val[9]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[8]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[7]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[6]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[5]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[4]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[3]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[2]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[1]}]
set_load -pin_load 0.0334 [get_ports {buffer_val[0]}]
set_load -pin_load 0.0334 [get_ports {corner[2]}]
set_load -pin_load 0.0334 [get_ports {corner[1]}]
set_load -pin_load 0.0334 [get_ports {corner[0]}]
set_load -pin_load 0.0334 [get_ports {dac[9]}]
set_load -pin_load 0.0334 [get_ports {dac[8]}]
set_load -pin_load 0.0334 [get_ports {dac[7]}]
set_load -pin_load 0.0334 [get_ports {dac[6]}]
set_load -pin_load 0.0334 [get_ports {dac[5]}]
set_load -pin_load 0.0334 [get_ports {dac[4]}]
set_load -pin_load 0.0334 [get_ports {dac[3]}]
set_load -pin_load 0.0334 [get_ports {dac[2]}]
set_load -pin_load 0.0334 [get_ports {dac[1]}]
set_load -pin_load 0.0334 [get_ports {dac[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lower[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_time[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_val[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {upper[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _571_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _571_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _571_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.12    0.42    0.42 ^ _571_/Q (sky130_fd_sc_hd__dfrtp_2)
     4    0.02                           fll_core.counter1.count[0] (net)
                  0.12    0.00    0.42 ^ _314_/A (sky130_fd_sc_hd__inv_2)
                  0.04    0.06    0.48 v _314_/Y (sky130_fd_sc_hd__inv_2)
     3    0.01                           _001_ (net)
                  0.04    0.00    0.48 v _571_/D (sky130_fd_sc_hd__dfrtp_2)
                                  0.48   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _571_/CLK (sky130_fd_sc_hd__dfrtp_2)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.48   data arrival time
-----------------------------------------------------------------------------
                                  0.24   slack (MET)


Startpoint: _571_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _572_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _571_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.12    0.42    0.42 ^ _571_/Q (sky130_fd_sc_hd__dfrtp_2)
     4    0.02                           fll_core.counter1.count[0] (net)
                  0.12    0.00    0.42 ^ _496_/B (sky130_fd_sc_hd__xor2_2)
                  0.03    0.06    0.49 v _496_/X (sky130_fd_sc_hd__xor2_2)
     1    0.00                           _002_ (net)
                  0.03    0.00    0.49 v _572_/D (sky130_fd_sc_hd__dfrtp_2)
                                  0.49   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _572_/CLK (sky130_fd_sc_hd__dfrtp_2)
                         -0.01    0.24   library hold time
                                  0.24   data required time
-----------------------------------------------------------------------------
                                  0.24   data required time
                                 -0.49   data arrival time
-----------------------------------------------------------------------------
                                  0.25   slack (MET)


Startpoint: _580_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _580_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _580_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.12    0.42    0.42 ^ _580_/Q (sky130_fd_sc_hd__dfrtp_2)
     5    0.02                           fll_core.counter1.count[9] (net)
                  0.12    0.00    0.43 ^ _476_/A (sky130_fd_sc_hd__xor2_2)
                  0.03    0.07    0.50 v _476_/X (sky130_fd_sc_hd__xor2_2)
     1    0.00                           _010_ (net)
                  0.03    0.00    0.50 v _580_/D (sky130_fd_sc_hd__dfrtp_2)
                                  0.50   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _580_/CLK (sky130_fd_sc_hd__dfrtp_2)
                         -0.01    0.24   library hold time
                                  0.24   data required time
-----------------------------------------------------------------------------
                                  0.24   data required time
                                 -0.50   data arrival time
-----------------------------------------------------------------------------
                                  0.26   slack (MET)


Startpoint: _573_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _573_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _573_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.08    0.39    0.39 ^ _573_/Q (sky130_fd_sc_hd__dfrtp_2)
     3    0.01                           fll_core.counter1.count[2] (net)
                  0.08    0.00    0.39 ^ _460_/B1 (sky130_fd_sc_hd__a21oi_2)
                  0.03    0.04    0.43 v _460_/Y (sky130_fd_sc_hd__a21oi_2)
     1    0.00                           _240_ (net)
                  0.03    0.00    0.43 v _461_/B (sky130_fd_sc_hd__nor2_2)
                  0.05    0.06    0.49 ^ _461_/Y (sky130_fd_sc_hd__nor2_2)
     1    0.00                           _003_ (net)
                  0.05    0.00    0.49 ^ _573_/D (sky130_fd_sc_hd__dfrtp_2)
                                  0.49   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _573_/CLK (sky130_fd_sc_hd__dfrtp_2)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.49   data arrival time
-----------------------------------------------------------------------------
                                  0.26   slack (MET)


Startpoint: _574_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _574_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _574_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.08    0.39    0.39 ^ _574_/Q (sky130_fd_sc_hd__dfrtp_2)
     3    0.01                           fll_core.counter1.count[3] (net)
                  0.08    0.00    0.39 ^ _463_/A (sky130_fd_sc_hd__nor2_2)
                  0.03    0.04    0.44 v _463_/Y (sky130_fd_sc_hd__nor2_2)
     1    0.00                           _242_ (net)
                  0.03    0.00    0.44 v _464_/B (sky130_fd_sc_hd__nor2_2)
                  0.05    0.05    0.49 ^ _464_/Y (sky130_fd_sc_hd__nor2_2)
     1    0.00                           _004_ (net)
                  0.05    0.00    0.49 ^ _574_/D (sky130_fd_sc_hd__dfrtp_2)
                                  0.49   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _574_/CLK (sky130_fd_sc_hd__dfrtp_2)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.49   data arrival time
-----------------------------------------------------------------------------
                                  0.26   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: _596_ (rising edge-triggered flip-flop)
Endpoint: dac[2] (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.19    0.00    0.00 ^ _596_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.29    0.61    0.61 ^ _596_/Q (sky130_fd_sc_hd__dfrtp_2)
     2    0.04                           buffer_val[2] (net)
                  0.29    0.00    0.62 ^ _606_/A (sky130_fd_sc_hd__buf_2)
                  0.17    0.29    0.90 ^ _606_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           dac[2] (net)
                  0.17    0.00    0.90 ^ dac[2] (out)
                                  0.90   data arrival time

                  0.15   40.00   40.00   clock clk (rise edge)
                          0.00   40.00   clock network delay (ideal)
                         -0.25   39.75   clock uncertainty
                          0.00   39.75   clock reconvergence pessimism
                         -8.00   31.75   output external delay
                                 31.75   data required time
-----------------------------------------------------------------------------
                                 31.75   data required time
                                 -0.90   data arrival time
-----------------------------------------------------------------------------
                                 30.85   slack (MET)


Startpoint: _595_ (rising edge-triggered flip-flop)
Endpoint: dac[1] (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.19    0.00    0.00 ^ _595_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.28    0.60    0.60 ^ _595_/Q (sky130_fd_sc_hd__dfrtp_2)
     2    0.04                           buffer_val[1] (net)
                  0.28    0.00    0.61 ^ _605_/A (sky130_fd_sc_hd__buf_2)
                  0.17    0.29    0.89 ^ _605_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           dac[1] (net)
                  0.17    0.00    0.89 ^ dac[1] (out)
                                  0.89   data arrival time

                  0.15   40.00   40.00   clock clk (rise edge)
                          0.00   40.00   clock network delay (ideal)
                         -0.25   39.75   clock uncertainty
                          0.00   39.75   clock reconvergence pessimism
                         -8.00   31.75   output external delay
                                 31.75   data required time
-----------------------------------------------------------------------------
                                 31.75   data required time
                                 -0.89   data arrival time
-----------------------------------------------------------------------------
                                 30.86   slack (MET)


Startpoint: _600_ (rising edge-triggered flip-flop)
Endpoint: dac[6] (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.19    0.00    0.00 ^ _600_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.27    0.60    0.60 ^ _600_/Q (sky130_fd_sc_hd__dfrtp_2)
     2    0.04                           buffer_val[6] (net)
                  0.27    0.00    0.60 ^ _610_/A (sky130_fd_sc_hd__buf_2)
                  0.18    0.29    0.89 ^ _610_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           dac[6] (net)
                  0.18    0.00    0.89 ^ dac[6] (out)
                                  0.89   data arrival time

                  0.15   40.00   40.00   clock clk (rise edge)
                          0.00   40.00   clock network delay (ideal)
                         -0.25   39.75   clock uncertainty
                          0.00   39.75   clock reconvergence pessimism
                         -8.00   31.75   output external delay
                                 31.75   data required time
-----------------------------------------------------------------------------
                                 31.75   data required time
                                 -0.89   data arrival time
-----------------------------------------------------------------------------
                                 30.86   slack (MET)


Startpoint: _599_ (rising edge-triggered flip-flop)
Endpoint: dac[5] (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.19    0.00    0.00 ^ _599_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.27    0.59    0.59 ^ _599_/Q (sky130_fd_sc_hd__dfrtp_2)
     2    0.04                           buffer_val[5] (net)
                  0.27    0.00    0.59 ^ _609_/A (sky130_fd_sc_hd__buf_2)
                  0.17    0.28    0.88 ^ _609_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           dac[5] (net)
                  0.17    0.00    0.88 ^ dac[5] (out)
                                  0.88   data arrival time

                  0.15   40.00   40.00   clock clk (rise edge)
                          0.00   40.00   clock network delay (ideal)
                         -0.25   39.75   clock uncertainty
                          0.00   39.75   clock reconvergence pessimism
                         -8.00   31.75   output external delay
                                 31.75   data required time
-----------------------------------------------------------------------------
                                 31.75   data required time
                                 -0.88   data arrival time
-----------------------------------------------------------------------------
                                 30.87   slack (MET)


Startpoint: _598_ (rising edge-triggered flip-flop)
Endpoint: dac[4] (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.19    0.00    0.00 ^ _598_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.25    0.58    0.58 ^ _598_/Q (sky130_fd_sc_hd__dfrtp_2)
     2    0.04                           buffer_val[4] (net)
                  0.25    0.00    0.58 ^ _608_/A (sky130_fd_sc_hd__buf_2)
                  0.17    0.28    0.86 ^ _608_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           dac[4] (net)
                  0.17    0.00    0.86 ^ dac[4] (out)
                                  0.86   data arrival time

                  0.15   40.00   40.00   clock clk (rise edge)
                          0.00   40.00   clock network delay (ideal)
                         -0.25   39.75   clock uncertainty
                          0.00   39.75   clock reconvergence pessimism
                         -8.00   31.75   output external delay
                                 31.75   data required time
-----------------------------------------------------------------------------
                                 31.75   data required time
                                 -0.86   data arrival time
-----------------------------------------------------------------------------
                                 30.89   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: _596_ (rising edge-triggered flip-flop)
Endpoint: dac[2] (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.19    0.00    0.00 ^ _596_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.29    0.61    0.61 ^ _596_/Q (sky130_fd_sc_hd__dfrtp_2)
     2    0.04                           buffer_val[2] (net)
                  0.29    0.00    0.62 ^ _606_/A (sky130_fd_sc_hd__buf_2)
                  0.17    0.29    0.90 ^ _606_/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           dac[2] (net)
                  0.17    0.00    0.90 ^ dac[2] (out)
                                  0.90   data arrival time

                  0.15   40.00   40.00   clock clk (rise edge)
                          0.00   40.00   clock network delay (ideal)
                         -0.25   39.75   clock uncertainty
                          0.00   39.75   clock reconvergence pessimism
                         -8.00   31.75   output external delay
                                 31.75   data required time
-----------------------------------------------------------------------------
                                 31.75   data required time
                                 -0.90   data arrival time
-----------------------------------------------------------------------------
                                 30.85   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 30.85

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.24
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk
Latency      CRPR       Skew
_591_/CLK ^
   8.31
_571_/CLK ^
   0.06      0.00       8.25

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             1.33e-05   4.47e-06   3.69e-10   1.78e-05  43.0%
Combinational          1.32e-05   1.04e-05   1.18e-09   2.36e-05  57.0%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  2.65e-05   1.48e-05   1.55e-09   4.14e-05 100.0%
                          64.1%      35.9%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 3635 u^2 57% utilization.
area_report_end
